app/Http/Controllers/Admin/HomeController.php

    public function index()
    {
        $total_usuarios = User::count();
        $total_secretarias = Secretaria::count();
        $total_estudiantes = Estudiante::count();

        $total_profesores = Profesor::count();
        $total_horarios = Horario::count();
        $total_clases = Clase::count();
        $total_configuraciones = Config::count();
        $total_cursos = Auth()->user()->profesor ? Auth()->user()->profesor->cursos->count() : Curso::count();
---
select count(*) as aggregate from `users`
select count(*) as aggregate from `secretarias`
select count(*) as aggregate from `estudiantes`
select count(*) as aggregate from `profesors`
select count(*) as aggregate from `horarios`
select count(*) as aggregate from `clases`
select count(*) as aggregate from `configs`
select count(*) as aggregate from `cursos`

    private function handleStaffDashboard()
    {
        $cursosDisponibles = Curso::all();
        $profesorSelect = DB::table('profesors')
            ->join('horario_profesor_curso', 'horario_profesor_curso.profesor_id', '=', 'profesors.id')
            ->join('horarios', 'horario_profesor_curso.horario_id', '=', 'horarios.id')
            ->join('cursos', 'horario_profesor_curso.curso_id', '=', 'cursos.id') // Usamos la tabla intermedia
            ->join('estudiante_curso', 'cursos.id', '=', 'estudiante_curso.curso_id')
            ->join('estudiantes', 'estudiante_curso.estudiante_id', '=', 'estudiantes.id')
            ->join('users', 'estudiantes.user_id', '=', 'users.id')
            ->select(
                'profesors.id',
                'profesors.nombres',
                'profesors.apellidos',
                DB::raw('GROUP_CONCAT(DISTINCT cursos.nombre ORDER BY cursos.nombre SEPARATOR ", ") as cursos')
            )
            ->groupBy('profesors.id', 'profesors.nombres', 'profesors.apellidos')
            ->limit(100)
            ->get();
---
select * from `cursos`
select `profesors`.`id`, `profesors`.`nombres`, `profesors`.`apellidos`, GROUP_CONCAT(DISTINCT cursos.nombre ORDER BY cursos.nombre SEPARATOR ", ") as cursos from `profesors` inner join `horario_profesor_curso` on `horario_profesor_curso`.`profesor_id` = `profesors`.`id` inner join `horarios` on `horario_profesor_curso`.`horario_id` = `horarios`.`id` inner join `cursos` on `horario_profesor_curso`.`curso_id` = `cursos`.`id` inner join `estudiante_curso` on `cursos`.`id` = `estudiante_curso`.`curso_id` inner join `estudiantes` on `estudiante_curso`.`estudiante_id` = `estudiantes`.`id` inner join `users` on `estudiantes`.`user_id` = `users`.`id` group by `profesors`.`id`, `profesors`.`nombres`, `profesors`.`apellidos` limit 100