app/Http/Controllers/Academico/Profesor/TareaController.php

select * from `cursos` where `cursos`.`id` in (1)
select * from `entregas` where `entregas`.`tarea_id` in (1, 2, 3, 4, 5)
select * from `tareas` where exists (select * from `cursos` where `tareas`.`curso_id` = `cursos`.`id` and exists (select * from `profesors` inner join `horario_profesor_curso` on `profesors`.`id` = `horario_profesor_curso`.`profesor_id` where `cursos`.`id` = `horario_profesor_curso`.`curso_id` and `profesor_id` = 2)) order by `fecha_entrega` desc limit 15 offset 0
select count(*) as aggregate from `tareas` where exists (select * from `cursos` where `tareas`.`curso_id` = `cursos`.`id` and exists (select * from `profesors` inner join `horario_profesor_curso` on `profesors`.`id` = `horario_profesor_curso`.`profesor_id` where `cursos`.`id` = `horario_profesor_curso`.`curso_id` and `profesor_id` = 2))
---
    public function index()
    {
        $user = Auth::user();
        $profesor = $user->profesor;
        // dump($user->toArray());
        // dd($profesor);
        // dd($profesor->cursos);
        // Obtener cursos del profesor
        $cursos = $profesor->cursos;

        if ($cursos->isEmpty()) {
            return redirect()->route('admin.home')->with([
                'swal' => '1',
                'info' => 'No tiene cursos asignados.',
                'icon' => 'warning',
            ]);
        }

        // Obtener todas las tareas de los cursos del profesor
        $tareas = Tarea::with(['curso', 'entregas'])
            ->whereHas(
                'curso.profesores',
                fn($q) => $q->where('profesor_id', $profesor->id)
            )
            ->latest('fecha_entrega')
            ->paginate(15);